# Class Notes for Kroenke & Auer Chapter 2

In [8]:
# Setup: Connect to the Cape Codd Outdoor database
%load_ext sql
%sql mysql+pymysql://me:mysql@localhost/cape_codd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

C:\Users\anchakraborty\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:166: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

'Connected: me@cape_codd'

In [14]:
%%sql 
SELECT * 
FROM INVENTORY

32 rows affected.

[(100, 100100, 'Std. Scuba Tank, Yellow', 250, 0),
 (200, 100100, 'Std. Scuba Tank, Yellow', 100, 50),
 (300, 100100, 'Std. Scuba Tank, Yellow', 100, 0),
 (400, 100100, 'Std. Scuba Tank, Yellow', 200, 0),
 (100, 100200, 'Std. Scuba Tank, Magenta', 200, 30),
 (200, 100200, 'Std. Scuba Tank, Magenta', 75, 75),
 (300, 100200, 'Std. Scuba Tank, Magenta', 100, 100),
 (400, 100200, 'Std. Scuba Tank, Magenta', 250, 0),
 (100, 101100, 'Dive Mask, Small Clear', 0, 500),
 (200, 101100, 'Dive Mask, Small Clear', 0, 500),
 (300, 101100, 'Dive Mask, Small Clear', 300, 200),
 (400, 101100, 'Dive Mask, Small Clear', 450, 0),
 (100, 101200, 'Dive Mask, Med Clear', 100, 500),
 (200, 101200, 'Dive Mask, Med Clear', 50, 500),
 (300, 101200, 'Dive Mask, Med Clear', 475, 0),
 (400, 101200, 'Dive Mask, Med Clear', 250, 250),
 (100, 201000, 'Half-dome Tent', 2, 100),
 (200, 201000, 'Half-dome Tent', 10, 250),
 (300, 201000, 'Half-dome Tent', 250, 0),
 (400, 201000, 'Half-dome Tent', 0, 250),
 (100, 202000, 'Half-dome Tent Vestibule', 10, 250),
 (200, 202000, 'Half-dome Tent Vestibule', 1, 250),
 (300, 202000, 'Half-dome Tent Vestibule', 100, 0),
 (400, 202000, 'Half-dome Tent Vestibule', 0, 200),
 (100, 301000, 'Light Fly Climbing Harness', 300, 250),
 (200, 301000, 'Light Fly Climbing Harness', 250, 250),
 (300, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 301000, 'Light Fly Climbing Harness', 0, 250),
 (100, 302000, 'Locking Carabiner, Oval', 1000, 0),
 (200, 302000, 'Locking Carabiner, Oval', 1250, 0),
 (300, 302000, 'Locking Carabiner, Oval', 500, 500),
 (400, 302000, 'Locking Carabiner, Oval', 0, 1000)]

In [11]:
%%sql
SELECT * 
FROM RETAIL_ORDER

3 rows affected.

[(1000, 10, '98110', 'December', 2014, Decimal('445.00')),
 (2000, 20, '02335', 'December', 2014, Decimal('310.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'))]

In [25]:
%%sql
SELECT 100/10.0;
SELECT count(*) from INVENTORY;
SELECT SKU, SKU_DESCRIPTION, DEPARTMENT, BUYER FROM SKU_DATA;
SELECT SKU, DEPARTMENT, BUYER, SKU_DESCRIPTION FROM SKU_DATA;
SELECT * from INVENTORY where QUANTITYONHAND < 10;

1 rows affected.
1 rows affected.
8 rows affected.
8 rows affected.
9 rows affected.

[(100, 101100, 'Dive Mask, Small Clear', 0, 500),
 (200, 101100, 'Dive Mask, Small Clear', 0, 500),
 (100, 201000, 'Half-dome Tent', 2, 100),
 (400, 201000, 'Half-dome Tent', 0, 250),
 (200, 202000, 'Half-dome Tent Vestibule', 1, 250),
 (400, 202000, 'Half-dome Tent Vestibule', 0, 200),
 (300, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 301000, 'Light Fly Climbing Harness', 0, 250),
 (400, 302000, 'Locking Carabiner, Oval', 0, 1000)]

In [29]:
%%sql
SELECT * from INVENTORY where QUANTITYONHAND < 10;
SELECT  DISTINCT Buyer, Department from SKU_DATA;

9 rows affected.
4 rows affected.

[('Pete Hansen', 'Water Sports'),
 ('Nancy Meyers', 'Water Sports'),
 ('Cindy Lo', 'Camping'),
 ('Jerry Martin', 'Climbing')]

In [31]:
%%sql
#SELECT SKU, SKU_DESCRIPTION, DEPARTMENT, BUYER FROM SKU_DATA ORDER BY SKU DESC
SELECT SKU, SKU_DESCRIPTION, DEPARTMENT, BUYER FROM SKU_DATA ORDER BY SKU_DESCRIPTION,SKU;

8 rows affected.

[(101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin'),
 (100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen')]

In [44]:
%%sql
CREATE VIEW SKU_TENTS AS
(SELECT SKU, SKU_Description FROM INVENTORY WHERE SKU_DESCRIPTION like '%Tent');
Select * from SKU_TENTS;
#DROP VIEW;

0 rows affected.
4 rows affected.
0 rows affected.

[]

In [41]:
%%sql
SELECT * FROM CATALOG_SKU_2014 WHERE DateOnWebsite = '04-JAN-1984';

0 rows affected.

[]

In [38]:
%%sql
SELECT * FROM SKU_DATA where Buyer IN ('Nancy Meyers','Cindy Lo','Jerry Martin');

6 rows affected.

[(101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [43]:
%%sql
DROP VIEW SKU_TENTS;

0 rows affected.

[]

In [49]:
%%sql
SELECT * FROM SKU_DATA WHERE SKU>200000 OR SKU_DESCRIPTION LIKE '%TENT%';

4 rows affected.

[(201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [51]:
%%sql
SELECT * FROM SKU_DATA WHERE (SKU>200000 OR SKU_DESCRIPTION LIKE '%TENT%') AND NOT Department = 'Camping';

2 rows affected.

[(301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin')]

In [52]:
%%sql
SELECT * FROM ORDER_ITEM where ExtendedPrice > AVG(ExtendedPrice);

(pymysql.err.ProgrammingError) (1111, 'Invalid use of group function') [SQL: 'SELECT * FROM ORDER_ITEM where ExtendedPrice > AVG(ExtendedPrice);']

In [53]:
%%sql
SELECT * FROM ORDER_ITEM where (Quantity * Price) > 150;

3 rows affected.

[(3000, 100200, 1, Decimal('300.00'), Decimal('300.00')),
 (2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (1000, 201000, 1, Decimal('300.00'), Decimal('300.00'))]

In [54]:
%%sql
SELECT SKU, COUNT(SKU), AVG(ExtendedPrice) FROM ORDER_ITEM GROUP BY SKU;

5 rows affected.

[(100200, 1, Decimal('300.000000')),
 (101100, 2, Decimal('150.000000')),
 (101200, 2, Decimal('75.000000')),
 (201000, 1, Decimal('300.000000')),
 (202000, 1, Decimal('130.000000'))]

In [61]:
%%sql
SELECT * FROM RETAIL_ORDER, ORDER_ITEM WHERE RETAIL_ORDER.OrderNumber = ORDER_ITEM.OrderNumber order by 1;

7 rows affected.

[(1000, 10, '98110', 'December', 2014, Decimal('445.00'), 1000, 201000, 1, Decimal('300.00'), Decimal('300.00')),
 (1000, 10, '98110', 'December', 2014, Decimal('445.00'), 1000, 202000, 1, Decimal('130.00'), Decimal('130.00')),
 (2000, 20, '02335', 'December', 2014, Decimal('310.00'), 2000, 101200, 2, Decimal('50.00'), Decimal('100.00')),
 (2000, 20, '02335', 'December', 2014, Decimal('310.00'), 2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 101200, 1, Decimal('50.00'), Decimal('50.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 101100, 2, Decimal('50.00'), Decimal('100.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 100200, 1, Decimal('300.00'), Decimal('300.00'))]

In [63]:
%%sql
SELECT * FROM SKU_DATA AS SD1,SKU_DATA AS SD2 where (SD1.SKU - SD2.SKU) BETWEEN 0 and 1000 order by 1;

15 rows affected.

[(100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen', 100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen'),
 (100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen', 100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen'),
 (100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen', 100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers', 100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers', 100100, 'Std. Scuba Tank, Yellow', 'Water Sports', 'Pete Hansen'),
 (101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers', 101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers', 101100, 'Dive Mask, Small Clear', 'Water Sports', 'Nancy Meyers'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers', 100200, 'Std. Scuba Tank, Magenta', 'Water Sports', 'Pete Hansen'),
 (101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers', 101200, 'Dive Mask, Med Clear', 'Water Sports', 'Nancy Meyers'),
 (201000, 'Half-dome Tent', 'Camping', 'Cindy Lo', 201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo', 201000, 'Half-dome Tent', 'Camping', 'Cindy Lo'),
 (202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo', 202000, 'Half-dome Tent Vestibule', 'Camping', 'Cindy Lo'),
 (301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin', 301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin', 302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin'),
 (302000, 'Locking Carabiner, Oval', 'Climbing', 'Jerry Martin', 301000, 'Light Fly Climbing Harness', 'Climbing', 'Jerry Martin')]

In [65]:
%%sql
Select * from Retail_order INNER JOIN ORDER_ITEM ON (RETAIL_ORDER.OrderNumber = ORDER_ITEM.OrderNumber) order by 1;

7 rows affected.

[(1000, 10, '98110', 'December', 2014, Decimal('445.00'), 1000, 201000, 1, Decimal('300.00'), Decimal('300.00')),
 (1000, 10, '98110', 'December', 2014, Decimal('445.00'), 1000, 202000, 1, Decimal('130.00'), Decimal('130.00')),
 (2000, 20, '02335', 'December', 2014, Decimal('310.00'), 2000, 101200, 2, Decimal('50.00'), Decimal('100.00')),
 (2000, 20, '02335', 'December', 2014, Decimal('310.00'), 2000, 101100, 4, Decimal('50.00'), Decimal('200.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 101200, 1, Decimal('50.00'), Decimal('50.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 101100, 2, Decimal('50.00'), Decimal('100.00')),
 (3000, 10, '98110', 'January', 2015, Decimal('480.00'), 3000, 100200, 1, Decimal('300.00'), Decimal('300.00'))]